### Quick Examples of Get Cell Value of DataFrame


# Below are some quick examples 

# Using loc[]. Get cell value by name & index
print(df.loc['r4']['Duration'])
print(df.loc['r4'][2])

# Using iloc[]. Get cell value by index & name
print(df.iloc[3]['Duration'])
print(df.iloc[3,2])


# Using DataFrame.at[]
print(df.at['r4','Duration'])
print(df.at[df.index[3],'Duration'])

# Using DataFrame.iat[]
print(df.iat[3,2])

# Get a cell value
print(df["Duration"].values[3])

# Get cell value from last row
print(df.iloc[-1,2])
print(df.iloc[-1]['Duration'])
print(df.at[df.index[-1],'Duration'])

In [1]:
import pandas as pd
technologies = {
     'Courses':["Spark","PySpark","Hadoop","Python","pandas"],
     'Fee' :[24000,25000,25000,24000,24000],
     'Duration':['30day','50days','55days', '40days','60days'],
     'Discount':[1000,2300,1000,1200,2500]
          }
index_labels=['r1','r2','r3','r4','r5']
df = pd.DataFrame(technologies, index=index_labels)
df

    Courses    Fee Duration  Discount
r1    Spark  24000    30day      1000
r2  PySpark  25000   50days      2300
r3   Hadoop  25000   55days      1000
r4   Python  24000   40days      1200
r5   pandas  24000   60days      2500

In [2]:
# Using loc[]. Get cell value by name & index
print(df.loc['r4']['Duration'])
print(df.loc['r4','Duration'])
print(df.loc['r4'][2])

40days
40days
40days

In [3]:
# Using iloc[]. Get cell value by index & name
print(df.iloc[3]['Duration'])
print(df.iloc[3][2])
print(df.iloc[3,2])

40days
40days
40days

In [4]:

# Using DataFrame.at[]
print(df.at['r4','Duration'])
print(df.at[df.index[3],'Duration'])

40days
40days

### Using DataFrame.iat[] select Specific Cell Value by Column Position

In [5]:
# Using DataFrame.iat[]
print(df.iat[3,2])

40days

In [6]:

# Get a cell value
print(df["Duration"].values[3])

40days

In [7]:
# Get cell value from last row
print(df.iloc[-1,2])                  # prints 60days
print(df.iloc[-1]['Duration'])        # prints 60days
print(df.at[df.index[-1],'Duration']) # prints 60days

60days
60days
60days

### Pandas Add Column to DataFrame

In [8]:
import pandas as pd
import numpy as np

technologies= {
    'Courses':["Spark","PySpark","Hadoop","Python","Pandas"],
    'Fee' :[22000,25000,23000,24000,26000],
    'Discount':[1000,2300,1000,1200,2500]
          }

df = pd.DataFrame(technologies)
print(df)

   Courses    Fee  Discount
0    Spark  22000      1000
1  PySpark  25000      2300
2   Hadoop  23000      1000
3   Python  24000      1200
4   Pandas  26000      2500

In [9]:
# Add new column to the DataFrame
tutors = ['William', 'Henry', 'Michael', 'John', 'Messi']
df2 = df.assign(TutorsAssigned=tutors)
print(df2)

   Courses    Fee  Discount TutorsAssigned
0    Spark  22000      1000        William
1  PySpark  25000      2300          Henry
2   Hadoop  23000      1000        Michael
3   Python  24000      1200           John
4   Pandas  26000      2500          Messi

In [10]:
# Add multiple columns to the DataFrame
MNCCompanies = ['TATA','HCL','Infosys','Google','Amazon']
df2 = df.assign(MNCComp = MNCCompanies,TutorsAssigned=tutors )
df2

   Courses    Fee  Discount  MNCComp TutorsAssigned
0    Spark  22000      1000     TATA        William
1  PySpark  25000      2300      HCL          Henry
2   Hadoop  23000      1000  Infosys        Michael
3   Python  24000      1200   Google           John
4   Pandas  26000      2500   Amazon          Messi

In [11]:
# Add new column at the specific position
df = pd.DataFrame(technologies)
df.insert(0,'Tutors', tutors ) #1st column e insert hobe
print(df)

    Tutors  Courses    Fee  Discount
0  William    Spark  22000      1000
1    Henry  PySpark  25000      2300
2  Michael   Hadoop  23000      1000
3     John   Python  24000      1200
4    Messi   Pandas  26000      2500

In [12]:
# Add new column by mapping to the existing column
df = pd.DataFrame(technologies)
tutors = {"Spark":"William", "PySpark":"Henry", "Hadoop":"Michael","Python":"John", "pandas":"Messi"}
df['Tutors'] = df['Courses'].map(tutors)
print(df)

   Courses    Fee  Discount   Tutors
0    Spark  22000      1000  William
1  PySpark  25000      2300    Henry
2   Hadoop  23000      1000  Michael
3   Python  24000      1200     John
4   Pandas  26000      2500      NaN

In [13]:
# Assign the column to the DataFrame
df = pd.DataFrame(technologies)
tutors = ['William', 'Henry', 'Michael', 'John', 'Messi']
df.loc[:, 'Tutors'] = tutors
print(df)

   Courses    Fee  Discount   Tutors
0    Spark  22000      1000  William
1  PySpark  25000      2300    Henry
2   Hadoop  23000      1000  Michael
3   Python  24000      1200     John
4   Pandas  26000      2500    Messi

### Pandas Rename Column

In [14]:
# Rename a Single Column 
df2=df.rename(columns = {'Courses':'Courses_List'})
print(df2.columns)

Index(['Courses_List', 'Fee', 'Discount', 'Tutors'], dtype='object')

In [15]:
df2

  Courses_List    Fee  Discount   Tutors
0        Spark  22000      1000  William
1      PySpark  25000      2300    Henry
2       Hadoop  23000      1000  Michael
3       Python  24000      1200     John
4       Pandas  26000      2500    Messi

In [16]:
# Alternatively you can write above code using axis
df3=df.rename({'Courses':'Courses_List'}, axis=1)
df4=df.rename({'Courses':'Courses_List'}, axis='columns',inplace=True)

In [17]:
df3

  Courses_List    Fee  Discount   Tutors
0        Spark  22000      1000  William
1      PySpark  25000      2300    Henry
2       Hadoop  23000      1000  Michael
3       Python  24000      1200     John
4       Pandas  26000      2500    Messi

In [18]:
df4

In [19]:
df

  Courses_List    Fee  Discount   Tutors
0        Spark  22000      1000  William
1      PySpark  25000      2300    Henry
2       Hadoop  23000      1000  Michael
3       Python  24000      1200     John
4       Pandas  26000      2500    Messi

In [20]:
# Rename multiple columns
df.rename(columns = {'Courses':'Courses_List','Fee':'Courses_Fee', 
   'Discount':'New_discount'}, inplace = True)
print(df.columns)

Index(['Courses_List', 'Courses_Fee', 'New_discount', 'Tutors'], dtype='object')

### Rename All Columns by adding Suffixes or Prefix

In [21]:
df2=df.add_prefix('col_')
print(df2.columns)

Index(['col_Courses_List', 'col_Courses_Fee', 'col_New_discount',
       'col_Tutors'],
      dtype='object')

In [22]:
# Pandas rename column by index
df.columns.values[2] = "new dis"

In [23]:
print(df.columns)

Index(['Courses_List', 'Courses_Fee', 'new dis', 'Tutors'], dtype='object')

In [24]:
#df.columns = ['col_'+str(col) for col in df.columns]

In [25]:
df.columns

Index(['Courses_List', 'Courses_Fee', 'new dis', 'Tutors'], dtype='object')

In [26]:
df2=df.add_prefix('col_') #this is same in previous statement
print(df2.columns)

Index(['col_Courses_List', 'col_Courses_Fee', 'col_new dis', 'col_Tutors'], dtype='object')

### Rename or Convert All Columns to Lower or Upper Case

In [27]:
# Change to all lower case
df = pd.DataFrame(technologies)
df2=df.rename(str.lower, axis='columns')
print(df2.columns)

Index(['courses', 'fee', 'discount'], dtype='object')

In [28]:
# Change to all upper case
df = pd.DataFrame(technologies)
df2=df.rename(str.upper, axis='columns')
print(df2.columns)

Index(['COURSES', 'FEE', 'DISCOUNT'], dtype='object')

In [29]:
# Change column name using set_axis()
df.set_axis(['Courses_List', 'Course_Fee_new', 'Course_Duration'], axis=1, inplace=True)
print(df.columns)

Index(['Courses_List', 'Course_Fee_new', 'Course_Duration'], dtype='object')

C:\Users\Khalil\AppData\Local\Temp\ipykernel_1528\756120151.py:2: FutureWarning: DataFrame.set_axis 'inplace' keyword is deprecated and will be removed in a future version. Use `obj = obj.set_axis(..., copy=False)` instead
  df.set_axis(['Courses_List', 'Course_Fee_new', 'Course_Duration'], axis=1, inplace=True)

In [30]:
df

  Courses_List  Course_Fee_new  Course_Duration
0        Spark           22000             1000
1      PySpark           25000             2300
2       Hadoop           23000             1000
3       Python           24000             1200
4       Pandas           26000             2500

In [31]:
df.columns = df.columns.str.replace("_"," ")
print(df.columns)

Index(['Courses List', 'Course Fee new', 'Course Duration'], dtype='object')

In [32]:
# Throw Error when Rename column doesn't exists.
df.rename(columns = {'Courses List':'Course'}, errors = "raise")

    Course  Course Fee new  Course Duration
0    Spark           22000             1000
1  PySpark           25000             2300
2   Hadoop           23000             1000
3   Python           24000             1200
4   Pandas           26000             2500

In [33]:

# Change column only if column exists.
df = pd.DataFrame(technologies)
d={'Courses':'Courses_List','Fees':'Courses_fees'}
df.rename(columns={k: v for k, v in d.items() if k in df.columns}, inplace=True,errors = "raise")
print(df.columns)

Index(['Courses_List', 'Fee', 'Discount'], dtype='object')

### Pandas.DataFrame.drop() Syntax â€“ Drop Rows & Columns

df1 = df.drop(labels=['r1','r2'],axis=0)

# Delete Rows by Index numbers
df = pd.DataFrame(technologies,index=indexes)
df1=df.drop(df.index[[1,3]])
print(df1)